Autodesk.Revit.DB.SpatialElementTagOrientation
An enumerated type listing tag orientation options that are supported by SpatialElementTags.

Autodesk.Revit.DB.SpatialElementTagOrientation.Model
The Orientation of tag is Model.

Autodesk.Revit.DB.SpatialElementTagOrientation.Vertical
The Orientation of tag is Vertical.

Autodesk.Revit.DB.SpatialElementTagOrientation.Horizontal
The Orientation of tag is Horizontal.